// =========================================== ФУНКЦИИ ===============================================

// // ================================ Вариант 1 function declaration ============================
// function name (param1, param2, ...){
//     code block 
// }

// // =============================== Вариант 2 function expression ===============================
// let name = function (param1, param2,...){
//     statements 
//     return expression;
// }

// // ============================== Вариант 3 arrow function -стрелочная функция =================
// let name = (arg1, arg2, ...) => expression;
// // =============================================================================================
// ============================== function declaration ===================================

// 1. Слово function
// 2. Имя функции
// 3. Список параметров в круглых скобках через запятую
// 4. Код функции("тело функции") внутри фигурных скобок

function sum(a, b){
    let result = a + b
    return result                      // return возвращает результат
    // console.log (result)                  
}

// sum (6, 3)
let print = function(arg){
    console.log(arg);
}
print("Hi");                        // работает только после присвоения функции, название придуманно нами
// function sum(a, b = 6) {          // передает по дефолту b = 6 (в случае,если не дали значение b)
//       a = 8
//       let result = a + b
//       return result
//  }

// Хорошей практикой считается объявлять функцию внутри - локально
// ------------------------------------------------------------------























